extends 文本引擎
#用户层,不可更改
func _ready() -> void:
	初始化($"对话",$"对话/对话面板",$"对话/文本内容",$"对话/角色名称",$"对话/菜单",$"对话/背景")
	开始对话()

func 开始对话():
	await 清()
	await 画("背景","bg")
	await 文本("小白","你好","测试:",c_红色("快捷上色"))
	await 画("背景","bg2")
	await 画("头像标签","头像",对齐.居中)
	await 文本("小白","磁")
	await 画("头像标签","头像",对齐.全屏)
	await 文本("小黑","哇,吓我一跳")
	开始2()
func 开始2():
	
	await 文本("小白","开始要选项了")
	await 文本("小黑","好的")
	await 菜单(
		"第一个选项",
		"第二个选项",
	)
func 第一个选项():
	await 文本("小白","我知道了")
	开始对话() #返回开始
func 第二个选项():
	await 文本("小黑","我懂了")
	结束对话()
	#开始对话()#返回开始
